wdfk-prog/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_can.c
    baud_index = get_can_baud_index(cfg->baud_rate);
    drv_can->CanHandle.Init.SyncJumpWidth = BAUD_DATA(SJW, baud_index);
    drv_can->CanHandle.Init.TimeSeg1 = BAUD_DATA(BS1, baud_index);
    drv_can->CanHandle.Init.TimeSeg2 = BAUD_DATA(BS2, baud_index);
    drv_can->CanHandle.Init.Prescaler = BAUD_DATA(RRESCL, baud_index);
    /* init can */
    if (HAL_CAN_Init(&drv_can->CanHandle) != HAL_OK)
    {
        return -RT_ERROR;
    }

    /* default filter config */
    HAL_CAN_ConfigFilter(&drv_can->CanHandle, &drv_can->FilterConfig);

    return RT_EOK;
}

/**
 * @brief Synchronously abort selected STM32 bxCAN TX mailboxes.
 *
 * The generic mailbox mask is translated to the corresponding HAL mailbox
 * mask. Only non-empty selected mailboxes are aborted. After issuing the HAL
 * abort request, this function waits until every targeted mailbox reports its
 * TME bit set so callers can rely on hardware TX being quiescent on success.
 *
 * @note This function must be called from thread context because it may sleep
 *       while waiting for the hardware abort to complete.
 * @note The caller must prevent concurrent TX submissions while this function
 *       runs. `RT_CAN_CMD_ABORT_TX` establishes this exclusion before invoking
 *       the driver operation; direct callers must provide equivalent exclusion.
 *
 * @param[in] can A pointer to the CAN device.
 * @param[in] cfg A pointer to the mailbox mask and timeout configuration.
 * @return RT_EOK on success, -RT_ETIMEOUT on timeout, or another negative error code.
 */
static rt_err_t _can_abort_tx(struct rt_can_device *can, const struct rt_can_abort_tx_config *cfg)
{
    struct stm32_can *drv_can;
    CAN_HandleTypeDef *hcan;
    rt_uint32_t requested_mask;
    rt_uint32_t pending_mask = 0;
    rt_uint32_t hal_mask = 0;
    rt_uint32_t tsr;
    rt_tick_t start_tick;

    RT_ASSERT(can != RT_NULL);
    if (cfg == RT_NULL)
    {
        return -RT_EINVAL;
    }

    if (cfg->timeout < 0 && cfg->timeout != RT_WAITING_FOREVER)
    {
        return -RT_EINVAL;
    }

    if (rt_interrupt_get_nest() > 0)
    {
        return -RT_EINVAL;
    }

    drv_can = (struct stm32_can *)can->parent.user_data;
    RT_ASSERT(drv_can != RT_NULL);
    hcan = &drv_can->CanHandle;

    if (hcan->State == HAL_CAN_STATE_RESET)
    {
        return RT_EOK;
    }

    if (hcan->State != HAL_CAN_STATE_READY &&
        hcan->State != HAL_CAN_STATE_LISTENING)
    {
        return -RT_EBUSY;
    }

    requested_mask = cfg->mailbox_mask;
    tsr = READ_REG(hcan->Instance->TSR);

    if ((requested_mask & RT_CAN_TX_MAILBOX_0) != 0 && (tsr & CAN_TSR_TME0) == 0)
    {
        pending_mask |= RT_CAN_TX_MAILBOX_0;
        hal_mask |= CAN_TX_MAILBOX0;
    }
    if ((requested_mask & RT_CAN_TX_MAILBOX_1) != 0 && (tsr & CAN_TSR_TME1) == 0)
    {
        pending_mask |= RT_CAN_TX_MAILBOX_1;
        hal_mask |= CAN_TX_MAILBOX1;
    }
    if ((requested_mask & RT_CAN_TX_MAILBOX_2) != 0 && (tsr & CAN_TSR_TME2) == 0)
    {
        pending_mask |= RT_CAN_TX_MAILBOX_2;
        hal_mask |= CAN_TX_MAILBOX2;
    }

    if (hal_mask == 0)
    {
        return RT_EOK;
    }

    if (HAL_CAN_AbortTxRequest(hcan, hal_mask) != HAL_OK)
    {
        LOG_E("can%s abort tx request failed", drv_can->name);
        return -RT_ERROR;
    }

    start_tick = rt_tick_get();
    while (RT_TRUE)
    {
        rt_bool_t done = RT_TRUE;
        tsr = READ_REG(hcan->Instance->TSR);

        if ((pending_mask & RT_CAN_TX_MAILBOX_0) != 0 && (tsr & CAN_TSR_TME0) == 0)
        {
            done = RT_FALSE;
        }
        if ((pending_mask & RT_CAN_TX_MAILBOX_1) != 0 && (tsr & CAN_TSR_TME1) == 0)
        {
            done = RT_FALSE;
        }
        if ((pending_mask & RT_CAN_TX_MAILBOX_2) != 0 && (tsr & CAN_TSR_TME2) == 0)
        {
            done = RT_FALSE;
        }

        if (done)
        {
            return RT_EOK;
        }

        if (cfg->timeout == 0)
        {
            return -RT_ETIMEOUT;
        }

        if (cfg->timeout != RT_WAITING_FOREVER &&
            (rt_tick_t)(rt_tick_get() - start_tick) >= (rt_tick_t)cfg->timeout)
        {
            LOG_E("can%s abort tx timeout", drv_can->name);
            return -RT_ETIMEOUT;
        }

        rt_thread_mdelay(1);
    }
}

static rt_err_t _can_control(struct rt_can_device *can, int cmd, void *arg)
{
    rt_uint32_t argval;
    struct stm32_can *drv_can;
    struct rt_can_filter_config *filter_cfg;

    RT_ASSERT(can != RT_NULL);
    drv_can = (struct stm32_can *)can->parent.user_data;
    RT_ASSERT(drv_can != RT_NULL);

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
                HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN2_RX0_IRQn);
                HAL_NVIC_DisableIRQ(CAN2_RX1_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_MSG_PENDING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_FULL);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_OVERRUN);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_MSG_PENDING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_FULL);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_OVERRUN);
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN1_TX_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN2_TX_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_TX_MAILBOX_EMPTY);
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                NVIC_DisableIRQ(CAN1_SCE_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                NVIC_DisableIRQ(CAN2_SCE_IRQn);
            }
#endif
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_WARNING);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_PASSIVE);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_BUSOFF);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_LAST_ERROR_CODE);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR);
        }
        break;
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_MSG_PENDING);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_FULL);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO0_OVERRUN);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_MSG_PENDING);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_FULL);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_RX_FIFO1_OVERRUN);

            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_RX0_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
                HAL_NVIC_SetPriority(CAN1_RX1_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_RX0_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_RX0_IRQn);
                HAL_NVIC_SetPriority(CAN2_RX1_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_RX1_IRQn);
            }
#endif
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_TX_MAILBOX_EMPTY);

            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_TX_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_TX_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_TX_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_TX_IRQn);
            }
#endif
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_WARNING);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR_PASSIVE);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_BUSOFF);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_LAST_ERROR_CODE);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_ERROR);

            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_SCE_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_SCE_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_SCE_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_SCE_IRQn);
            }
#endif
        }
        break;
    case RT_CAN_CMD_SET_FILTER:
    {
        rt_uint32_t id_h = 0;
        rt_uint32_t id_l = 0;
        rt_uint32_t mask_h = 0;
        rt_uint32_t mask_l = 0;
        rt_uint32_t mask_l_tail = 0;  /*CAN_FxR2 bit [2:0]*/

